%------------------------------------------------------------------
% Лабораторная работа №5_1                      
% Задание №2-3-в
% Автор: Бушуев Никта Федорович     
% Дата: 22.03.2021 
%------------------------------------------------------------------
% (в) функции St:A&A*─6N, являющейся степенью слова a относительно
% буквы x:
%------------------------------------------------------------------
domains
    list = symbol*

predicates
    st(symbol, list, integer)
  
clauses
    st(_, [], 0).
    st(X, [X|T], R):- st(X, T, Rn), R = 1 + Rn, !.
    st(X, [_|T], R):- st(X, T, R).

goal
    st("q", ["q", "q", "a", "b", "c", "q", "q"], R).