%------------------------------------------------------------------
% Лабораторная работа №5                     
% Задание №2-2-1
% Автор: Бушуев Никта Федорович     
% Дата: 22.03.2021 
%------------------------------------------------------------------
% 2. Опишите декларативную семантику следующих программ
%------------------------------------------------------------------

domains
    arg=integer*
    sum=integer

predicates
    sum_lst(arg,sum)

clauses
    % Подсчитывает сумму элементов в списке
    sum_lst([],0).
    sum_lst([X|X1],Y):- sum_lst(X1,Y1),Y=Y1+X.

goal
    sum_lst([1, 2, 3], R).